#### pandas 라이브러리
- 테이블형 데이터를 다룰 수 있는 다양한 기능을 가진 라이브러리
- 컬럼, 로우, 값을 가지고 있는 형태의 데이터자료구조
- 현업.실무 -> pandas -> 원본데이터 (raw data) -> 불필요한 데이터를 제거 || 데이터와 데이터를 병합 (*데이터 전처리)
- pandas 자체만으로도 1개월 거뜬히 하고 남는다. -> 너무나 방대한 내용
- AtoZ : 하나에서 열까지 차근차근 학습 -> 실습예제 중심

#### EDA
- 탐색적 데이터 분석
- 방대한 데이터를 수집.저장 -> 어디서부터 어디까지를 사용할 것인가?
- 해당 데이터를 얼만큼 신뢰할 수 있을 것인가?
- 해당 데이터가 어떤 기준으로 어떤 플랫폼을 대상으로 수집된 것인가?
- 예시로 위와 같은 기준은 명확치 않은 상태에서는 데이터는 한낯 숫자와 문자에 불과!!
- 시각화 혹은 전처리를 하고자 할 때, 기준이 필요!!
- 탐색적 데이터 분석 -> 데이터를 분석하기 전 표준 가이드라인 중 하나의 개념!!!

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

#### 데이터를 처리할 때, 4가지의 중요포인트 CRUD
- C : Create
- R : Read
- U : Update
- D : Delete

In [2]:
import pandas as pd

seriesdata = pd.Series([70, 60, 90])

In [3]:
seriesdata

0    70
1    60
2    90
dtype: int64

In [4]:
import pandas as pd

seriesdata = pd.Series([70, 60, 90], index=["국어", "영어", "수학"])
seriesdata

국어    70
영어    60
수학    90
dtype: int64

In [5]:
seriesdata.index

Index(['국어', '영어', '수학'], dtype='object')

In [6]:
seriesdata.index = ["미술", "음악", "체육"]

In [7]:
seriesdata

미술    70
음악    60
체육    90
dtype: int64

In [8]:
seriesdata.values

array([70, 60, 90])

In [9]:
print(seriesdata["미술"]) # 대괄호표기법

70

In [10]:
print(seriesdata["음악"])

60

In [12]:
print(seriesdata.iloc[0])

70

In [13]:
print(seriesdata.iloc[1])

60

In [14]:
seriesdata

미술    70
음악    60
체육    90
dtype: int64

In [15]:
del seriesdata["미술"]

In [16]:
seriesdata

음악    60
체육    90
dtype: int64

In [18]:
import pandas as pd

df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15],
}, index = [2000, 2010, 2020])
df

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [19]:
df.index

Index([2000, 2010, 2020], dtype='int64')

In [20]:
df.index = [2001, 2002, 2003]

In [21]:
df

       미국    한국  중국
2001  2.1  0.40  10
2002  2.2  0.50  13
2003  2.3  0.45  15

In [22]:
df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [23]:
df.columns = ["일본", "필리핀", "러시아"]

In [24]:
df

       일본   필리핀  러시아
2001  2.1  0.40   10
2002  2.2  0.50   13
2003  2.3  0.45   15

In [25]:
df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [26]:
import pandas as pd

df = pd.DataFrame({
    "년도": [2000, 2010, 2020],
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.5, 0.45],
    "중국": [10, 13, 15],
})
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [27]:
df = df.set_index("년도")
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [28]:
df.index.name

'년도'

In [29]:
df.index.name = "연도"

In [32]:
df

     연도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [31]:
df = df.reset_index("연도")
df

     연도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.50  13
2  2020  2.3  0.45  15

In [34]:
df = df.set_index("연도")
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [35]:
df.loc[2000]

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [36]:
df.iloc[0]

미국     2.1
한국     0.4
중국    10.0
Name: 2000, dtype: float64

In [37]:
df["미국"]

연도
2000    2.1
2010    2.2
2020    2.3
Name: 미국, dtype: float64

In [38]:
print(df["미국"][2000])

2.1

In [39]:
print(df.loc[2000]["미국"])

2.1

In [40]:
df["일본"] = [1, 2, 3]

In [41]:
df

       미국    한국  중국  일본
연도
2000  2.1  0.40  10   1
2010  2.2  0.50  13   2
2020  2.3  0.45  15   3

In [42]:
del df["일본"]
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [43]:
df.loc[2021] = [1, 2, 3]

In [44]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15
2021  1.0  2.00   3

In [46]:
df.drop([2021]) # 자료형 중요성 : 인덱스 => 최초에 인덱스를 선언할 때, 자료 타입

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [47]:
df2 = df[["중국", "한국"]].copy()

In [48]:
df2

      중국    한국
연도
2000  10  0.40
2010  13  0.50
2020  15  0.45
2021   3  2.00

In [49]:
df

       미국    한국  중국
연도
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15
2021  1.0  2.00   3